"## Forecasting Volatility with Machine Learning and Rough Volatility: Example from the Crypto-Winter\n\nSiu Hin Tang, Mathieu Rosenbaum, and Chao Zhou ∗ † ‡\n\nJanuary 21, 2024\n\nAbstract. We extend the application and test the performance of a recently introduced volatility prediction framework encompassing LSTM and rough volatility. Our asset class of interest is cryptocurrencies, at the beginning of the 'cryptowinter' in 2022. We first show that to forecast volatility, a universal LSTM approach trained on a pool of assets outperforms traditional models. We then consider a parsimonious parametric model based on rough volatility and Zumbach effect. We obtain similar prediction performances with only five parameters whose values are non-asset-dependent. Our findings provide further evidence on the universality of the mechanisms underlying the volatility formation process.\n\nKeywords - Machine learning, LSTM, rough volatility, quadratic rough Heston, Zumbach effect, cryptocurrencies, Bitcoin\n\n## 1 Introduction\n\nIn Rosenbaum and Zhang (2022b), classical parametric models, non-parametric Long Short-Term Memory (LSTM), as well as a novel parsimonious rough volatilitybased predictor are used to predict stocks' volatility. The authors are successful in establishing some universal mechanism in the volatility formation process, and the rough volatility-based framework of Rosenbaum and Zhang (2022b) is able to forecast volatility better than traditional methods. In this paper, we are thus interested in testing the applicability and robustness of this approach by adapting the volatility forecasting framework to a different class of asset. Here we choose cryptocurrencies which is a much newer and younger market. Serving as a companion paper to Rosenbaum and Zhang (2022b), we aim at answering two questions in this work:\n\n- · Whether the devices used in the original paper predict volatility well for cryptocurrencies at the beginning of the so-called 'crypto-winter'.\n- · Whether the volatilities have the same properties as observed for stocks, such as the universality of their formation process across coins during this period.\n\nBitcoin, proposed in Nakamoto (2008), is a decentralized payment system where transactions are stored with blockchain technology, leveraging cryptographic algorithms. Many similar systems were introduced and formed a completely new asset class known as cryptocurrencies. Such electronic currencies offer many unique advantages over traditional fiat money. Since conception, cryptocurrencies have been a popular research topic in the academic community and have also received a lot of interest from financial institutions and the general public alike (Donier and Bonart, 2015; Griffin and Shams, 2020; Arnosti and Weinberg, 2022; Bianchi and Babiak, 2022; Fang et al., 2022; Malik et al., 2022). The recent work Takaishi (2020) pro-\n\nvided evidence that Bitcoin's volatility is rough, further justifying the inclusion of the rough volatility model in our work. The rapid increase in the number of listed coins on major cryptocurrency exchanges in recent years makes it more feasible to apply machine learning models such as the LSTM, and to demonstrate universality features.\n\nThe year 2022 corresponds to a significant price and volume drop in cryptocurrencies compared to the peak in late 2021, or the beginning of a 'crypto-winter' 1 2 3 4 . For example, we display in Figure 1 the prices and volumes from the two largest coins Bitcoin (BTC) and Ethereum (ETH).\n\nFigure 1: Price and weekly USDT trading volume of BTC and ETH, with the period Jan to Jun 2022 shaded.\n\n<!-- image -->\n\nThere have been a few studies focusing on using machine learning to predict\n\ncryptocurrency volatility. In D'Amato et al. (2022), deep neural networks are used to model the volatilities of the three most popular cryptocurrencies. The papers Kristjanpoller and Minutolo (2018) and Amirshahi and Lahmiri (2023) consider a hybrid approach combining neural networks and GARCH models to model cryptocurrency volatility, with the former using only Bitcoin and the latter using 27 coins. Compared with existing literature, we use a much larger set of 213 cryptocurrencies which enables us to show the universality of the volatility formation process across the asset class.\n\nThe rough volatility paradigm allows us to generate stylized facts of realized volatility (Gatheral et al., 2018; Bennedsen et al., 2022). It is also effective in pricing and hedging derivatives (Bayer et al., 2016; El Euch and Rosenbaum, 2018; El Euch et al., 2019; El Euch and Rosenbaum, 2019). With the simplest version of this approach, namely the rough fractional stochastic volatility (RFSV) model, volatility forecasts can be made with a simple formula that requires essentially one parameter, namely the Hurst parameter. The Hurst parameter is systematically around 0.1 for all different asset classes (Gatheral et al., 2018; Bennedsen et al., 2022; Wu et al., 2022), giving a quasi-universal volatility model and suggesting universality in the volatility formation process across assets. In this paper, we also estimate the Hurst parameter for many cryptocurrencies and demonstrate the same observation.\n\nIn Rosenbaum and Zhang (2022b), the authors presume that the universal volatility formation mechanism involves past returns. They extend the RFSV approach incorporating strong Zumbach effect (Zumbach, 2010) which corresponds to the feedback effect of price trends on volatility. To do so they incorporate a\n\nquadratic rough Heston (QRH) component to the RFSV. We recall the QRH model is particularly popular as it is able to reproduce market observations of SPX and VIX options (Gatheral et al., 2020; Rosenbaum and Zhang, 2022a) thanks to its rough nature and the Zumbach effect.\n\nWe focus on the problem of forecasting the daily volatility of cryptocurrencies one day ahead. In particular, one of our goals is to understand the universal aspects of the volatility formation process. One element towards this will be to investigate whether non-asset-dependent, generic, forecasting devices can lead to optimal predictions of future volatilities. First, we show that the LSTM approach performs better than classical autoregressive models, one of which is the heterogeneous autoregressive (HAR) model (Corsi, 2009). Then we use a combination of the RFSV and QRH for the parsimonious model candidate. We also conduct comparison tests to show that for this model, the universal version of the model performs very similarly to the one calibrated on each coin. This further confirms the universality of the volatility formation process from a parametric perspective.\n\nWe will follow the same structure as our companion paper Rosenbaum and Zhang (2022b). In Section 2, we describe our data and model evaluation metrics. In Section 3, we describe both the parametric and non-parametric forecasting devices. We compare in Section 4 the performances of different forecasting models to provide evidence of a universal volatility formation mechanism for cryptocurrencies. Our approach also enables us to uncover asymmetry properties in the cryptocurrencies' volatilities in contrast to the stocks' volatilities. In Section 5, we aim to describe a universal mechanism for the volatility formation process with a parsimonious parametric model relating future volatility with past volatilities and returns.\n\nWe conclude in Section 6.\n\n## 2 Data and evaluation metrics\n\nOur dataset contains 5-minute intraday prices of cryptocurrencies traded on the Binance exchange, with USDT, a popularly used stablecoin, as the base currency. Stablecoins are cryptocurrencies with price stabilization mechanisms, often in the form of pegging to some other assets such as traditional fiat money or other cryptocurrencies (Mita et al., 2019). In the case of USDT, it is pegged 1-to-1 with US dollars and can be considered a cryptocurrency version of USD . The Binance ex5 change is one of the largest cryptocurrency exchanges by trading volume and offers easily obtainable market data, including price, volume, and number of trades in intervals as granular as 5 minutes. The data is directly obtained from Binance.com.\n\nWe select 213 coins after filtering out coins that are stablecoins, leveraged, or have low liquidity or insufficient data. The training set is chosen to be the two-year period from 2020-01-01 to 2021-12-31 , and the test set is a six-month period from 2022-01-01 to 2022-06-30 .\n\nDue to the rapid increase in the number of cryptocurrencies in recent years and the issue of past data availability, we choose not to use training data from before 2020. The distribution of the number of available data points in the entire 2.5-year period for selected coins is given in Figure 2. Note that the selected coins do not have the same number of available data points. While it would be ideal for every coin to have the same number of data points, it is not necessary for our approach\n\nand would require filtering out many more coins.\n\nFigure 2: Distribution of the number of available data points for selected coins.\n\n<!-- image -->\n\nThe daily realized volatility for day t , σ t , the variable of interest, is computed as\n\n<!-- formula-not-decoded -->\n\nwhere r t,i is the i th 5-minute returns of the day, defined as\n\n<!-- formula-not-decoded -->\n\nwhere P is the i 5-minute closing price of day t ( P is the open price of day t ).\n\nSimilarly, the return of day t\n\nt,i th t, 0 is defined as\n\n<!-- formula-not-decoded -->\n\nwhere P t is the closing price of day t . Since cryptocurrencies trade 24 hours per day every day, daily volatilities and returns are for 24-hour periods. The volatilities and returns are scaled and normalized respectively by the individual coin's statistics calculated on the training set.\n\nFor model evaluation, we choose to use the mean-squared-error or MSE, calculated as\n\n<!-- formula-not-decoded -->\n\nwhere T is the number of trading days in the test set and ˆ σ t is the model forecast for σ t . According to Patton (2011), it is a robust and homogeneous metric for evaluating and comparing volatility models.\n\n## 3 Forecasting devices\n\nHere we introduce the parametric and non-parametric forecasting devices in this study.\n\n## 3.1 Parametric models\n\nFirst, we consider two auto-regressive type models. One is a classical autoregressive (AR) model, the other is a heterogeneous autoregressive (HAR) model (Corsi, 2009). Due to the fact that cryptocurrencies are traded every day, for the HAR, the windows are chosen to be 7 and 30 instead of 5 and 22 in the literature on traditional markets. More precisely we define:\n\n- · AR p\n\np is chosen to be 7 or 30.\n\n## · HAR\n\n<!-- formula-not-decoded -->\n\n<!-- formula-not-decoded -->\n\nThese two models are fitted on individual coin data.\n\nFor the RFSV, the log-volatility is modeled as a fractional Brownian motion W H t :\n\n<!-- formula-not-decoded -->\n\nThe Hurst parameter H and ν can be estimated using the method in Gatheral et al. (2018).\n\nAs in Gatheral et al. (2018); Rosenbaum and Zhang (2022b), the predictor for H &lt; 1 2 is given by:\n\n<!-- formula-not-decoded -->\n\nwhere c = exp( Γ( 3 2 -H ) 2Γ( H + )Γ(2 1 2 -2 H ) ν 2 ). We will see in Section 5 that c is empirically very close to 1, and the impact of ν 2 on the forecast is marginal. H is calibrated using the pooled data set with all the coins.\n\n## 3.2 Non-parametric forecasting with LSTM\n\nThe recurrent neural network (RNN) is suitable for sequential learning tasks. Among types of RNNs, the Long Short-Term Memory (LSTM) neural network, introduced in Hochreiter and Schmidhuber (1997), is one of the most popular choices for predicting financial time series.\n\nFor each timestep t , the following computations are performed:\n\n<!-- formula-not-decoded -->\n\nwhere the superscript indexes the layer, c l t , h l t are the cell and hidden states, x l t equals the t -th element of the input sequence ( σ t ) or ( σ , r t t ) when l = 1 or h l -1 t for l &gt; 1, s ( ) · is the sigmoid function, ∗ is the Hadamard product, W l . and b l . are parameters to learn from data. LSTMs use gates i , f , and o to capture long-range dependence in the sequential data and to avoid the vanishing gradient problem of classical RNNs (Hochreiter and Schmidhuber, 1997; Goodfellow et al., 2016).\n\nWe use LSTMs with input length p , which are also chosen to be 7 or 30. The inputs can be volatilities or both volatilities and returns. We denote them by LSTM p,var and LSTM p,ret respectively. The LSTM consists of one LSTM layer and one dense output layer. The dimensions of h 1 t for LSTM p,var and LSTM p,ret are chosen to be 2 and 4 respectively. The number of hidden LSTM layers is 1, followed by 1 dense output layer. These configurations are tuned using a cross-validation split within the training data. We use the SiLU, introduced in Hendrycks and Gimpel (2020), as the activation function.\n\nNeural network fitting uses stochastic gradient descent and the results are noisy.\n\nTherefore we train 10 identically structured models, initialized with 10 different seeds. Lastly, we use the average of all their predictions as the final prediction. The optimizer we use is Adam, introduced in Kingma and Ba (2015), with a learning rate of 1e-3. The LSTMs are trained using the pooled data set.\n\n## 4 Towards universality in the volatility formation process\n\nIn this section, we compare different forecasting devices and show that we can achieve optimal performance with the universal ones. We also analyze the local sensitivities of the LSTMs and relate them to asymmetric volatility.\n\n## 4.1 Parametric vs LSTM\n\nIn Figure 3, we have each model's MSE relative to HAR, grouped by coins. For each coin, we calculate the MSE ratio on a coin as the models' MSE divided by the baseline model's MSE on that coin's out-of-sample data. If the MSE ratio is less than 1 for a certain coin and model, then the model outperformed the baseline on the coin. We can see that:\n\n- · AR 7 underperforms HAR.\n- · AR 30 is on par with HAR.\n- · LSTMs outperform HAR in general.\n- · LSTMs with a longer window show significantly better performances than those with a shorter window.\n\n- · LSTMs with return inputs show significantly better performances than those without.\n- · RFSV outperforms HAR, is slightly better than LSTM 7,var and is close to LSTM 30,var , but underperforms LSTM 7,ret and LSTM 30,ret .\n\nThese are largely consistent with the relative performances in Rosenbaum and Zhang (2022b). We see that LSTMs and RFSV, which are calibrated with the pooled dataset, outperform linear models calibrated specifically to each coin. This not only supports the use of the two non-linear model types, but also the suspected universality in volatility which is captured by these models.\n\nFigure 3: Boxplots of MSE ratios of each model using HAR as the baseline.\n\n<!-- image -->\n\n## 4.2 Local sensitivities and asymmetric volatility\n\nWe define local sensitivities by:\n\n<!-- formula-not-decoded -->\n\nHere we obtain the gradients of the predictions with respect to each of the inputs of LSTM 30,ret . For each coin, α τ ( ) is given by the average of α t ( τ ) across t in the test set, similarly β τ ( ) is the average of β t ( τ ) across t in the test set. We then plot the average of these values across coins with a band of one standard deviation in Figure 4. The plot of α τ ( ) looks very similar to the one for stocks in Rosenbaum and Zhang (2022b). We observe that the values are significantly positive, have a similar magnitude, and decay with increasing τ .\n\nFor β τ ( ), the values are one order smaller than α τ ( ), also decay in τ , and are positive for cryptocurrencies. In Rosenbaum and Zhang (2022b), β τ ( ) are observed to be negative for stocks. In both cases, the LSTMs captured a significant effect of returns on next-day volatilities, but the different signs of β for the two asset classes are a curious observation. If we use volatility as an indicator of trading activity or even the popularity of an asset, we might hypothesize that cryptocurrency traders react to positive returns more than to negative returns, while stock traders do the opposite. By extension, we can also speculate that the typologies of market participants are different between the two asset classes.\n\nIt has been previously observed that for cryptocurrencies, positive price shocks increase the volatility more than negative shocks do (Baur and Dimpfl, 2018; Cheikh et al., 2020; Kakinaka and Umeno, 2022). This phenomenon is known as inverted asymmetric volatility. In traditional markets, such as the stock market, the observed asymmetry is reversed, i.e. negative price shocks increase volatility more than positive shocks. Such an observation has often been attributed to the 'fear of missing out' (FOMO) of uninformed cryptocurrency traders (Delfabbro et al., 2021), and the existence of 'pump and dump' schemes (Li et al., 2021). A common\n\nFigure 4: Mean α τ ( ) and β τ ( ) across coins and a one standard deviation band.\n\n<!-- image -->\n\nconclusion in these previous works is that the observation comes from the difference in behaviour and trading activity by uninformed and informed traders dominating the cryptocurrency and stock market respectively.\n\nA nice byproduct of our methodology is a novel way to capture this inverted asymmetry in cryptocurrencies with the LSTM. We have also provided supportive evidence of this phenomenon across a much wider selection of cryptocurrencies than in previous studies of asymmetric volatility, confirming this observation on a large scale. Additionally, in tandem with Rosenbaum and Zhang (2022b), in which an asymmetry is also observed using a similar method, we have strong evidence from large baskets of assets from both asset classes that the asymmetry in cryptocurrencies is opposite from that in the stock market.\n\nFigure 5 plots the model prediction ˆ and gradients σ α t ( τ ), β t ( τ ) against σ 2 t -1 and r t -1 for all datapoints, without grouping by coin.\n\nFigure 5: Top left: ˆ against σ σ 2 t -1 , top right: ˆ against σ r t -1 , bottom left: α t (1) against σ 2 t -1 , bottom right: β t (1) against r t -1 .\n\n<!-- image -->\n\n## 4.3 Comparing universal and non-universal LSTMs\n\n## 4.3.1 Universality across different market capitalisation levels\n\nA new LSTM 30,ret is trained on the top 50 coins by market capitalization (on 2021-12-31, the last day of the training period) only and compared with the universal one on the test period. The relative performance is shown in Figure 6. There is no degradation of performance by the much smaller set of coins used in training, which suggests some universality of volatility formation across coins at different levels of market capitalization.\n\nFigure 6: Distribution of MSE ratios of LSTM 30,ret trained with the top 50 coins by market capitalization using the universal LSTM 30,ret as baseline.\n\n<!-- image -->\n\n## 4.3.2 No asset dependent mechanisms\n\nNext, the universal LSTM 30,ret is fine-tuned to each individual coin's data to study whether this would improve its performance on individual coins. Fine-tuning of neural networks is done by initiating a neural network's parameters with a trained one, then further training it with an often smaller dataset. In our case, for each available coin, we initialize neural networks with the universal LSTM 30,ret , then train it further with only that coin's training data.\n\nIf there were any asset-specific mechanisms that could be captured by the LSTM, we should see the fine-tuned LSTMs performing better. Here we allow all parameters to be changed during fine-tuning. The relative performance is shown in Figure 7. The fine-tuned models do not perform better. This supports that there are no asset-dependent mechanisms in volatility formation for the coins.\n\nFigure 7: Distribution of MSE ratios of LSTM 30,ret fine-tuned to each coin using the universal LSTM 30,ret as baseline.\n\n<!-- image -->\n\n## 5 Uncovering universal mechanisms in the volatility formation process\n\nIn this section, we calibrate the RFSV to each coin to confirm the universality of the volatility formation process. Then we incorporate the strong Zumbach effect into the rough-volatility based model by adding a quadratic rough Heston component. By comparing the combined model to the LSTM and RFSV, we obtain a promising candidate for the description of a universal volatility formation process.\n\n## 5.1 RFSV\n\nFor RFSV, we first estimate H and c for each coin, and the distributions are shown in Figures 8 and 9. H and c tend to be higher than the ones for stocks as found in Rosenbaum and Zhang (2022b). The median of H and c are 0.103 and 1.06 respectively.\n\nFigure 8: Distribution of H.\n\n<!-- image -->\n\nFigure 9: Distribution of c.\n\n<!-- image -->\n\nTo once again check for universality from a parametric perspective, RFSVs are calibrated to each coin and compared with the universal RFSV that is calibrated to all coins. The relative performance is shown in Figure 10. The asset-specific RFSVs perform very similarly to the universal RFSV. Similar to fine-tuned LSTMs, we would expect improvements from the asset-specific RFSVs if there were any coin-\n\nspecific mechanisms that could be captured by RFSV. Once again we obtain further evidence of a lack of asset-specific mechanisms from a parametric perspective.\n\nFigure 10: Distribution of MSE ratios of RFSV calibrated to each coin using the universal RFSV as baseline.\n\n<!-- image -->\n\n## 5.2 RFSV enhanced with QRH\n\nHere we use the forecasting device based on the Zumbach effect from Rosenbaum and Zhang (2022a,b) via a quadratic rough Heston component. The forecasting formula from the QRH model is given by\n\n<!-- formula-not-decoded -->\n\n<!-- formula-not-decoded -->\n\nwhere a, b, c &gt; 0, and ( c d i , γ d i ) i =1 ,...,n are given by the same multi-factor approximation of the rough kernel function K t ( ) := t H -1 / 2 Γ( H +1 2) / (Rosenbaum and Zhang, 2022a). Given H and n , ( c d , γ d ) i =1 2 , ,...,n are not free parameters. The predictions are essen-\n\ni i\n\ntially moving averages of past realized volatilities and are not sensitive to the earliest inputs due to the exponential decay in weights. In practice after computing Z i,t , one needs to discard the earliest samples without sufficient histories. By including the QRH, we have three more parameters a, b, c to calibrate which can be done by regressing σ 2 t on ( Z t -1 , Z 2 t -1 ).\n\nWe will combine the predictions from RFSV and QRH linearly. The final prediction is given by (1 -λ σ )ˆ RFSV + λσ ˆ QRH . The relative performances for different values for λ to RFSV only are shown in Figure 11, the relative performances to LSTM 30,ret are shown in Figure 12.\n\nIncorporating past returns in the RFSV through the QRH component is a clear improvement. At λ = 0 15, . the model performs best and is very similar to LSTM 30,ret . This gives us a parsimonious parametric model candidate for a universal volatility mechanism.\n\nWe also note the larger optimal value for λ than that in Rosenbaum and Zhang (2022b) for stocks. Past returns play a larger part in the volatility formation in cryptocurrencies than in stocks.\n\n## 6 Conclusion\n\nIn this work, we adapt the volatility forecasting framework of Rosenbaum and Zhang (2022b) and extend it to a different asset class. The framework and forecasting devices used in the original paper are applied to the daily volatilities of cryptocurrencies at the start of the 'crypto-winter' crisis where prices and trading\n\nFigure 11: Boxplots of MSE ratios of (1 -λ σ )ˆ RFSV + λσ ˆ QRH with different positive values for λ using RFSV only ( λ = 0) as baseline.\n\n<!-- image -->\n\nFigure 12: Boxplots of MSE ratios of (1 -λ σ )ˆ RFSV + λσ ˆ QRH with different values for λ using LSTM 30,ret as baseline.\n\n<!-- image -->\n\nvolume dropped. This is also the first study of cryptocurrency volatility in which a wide selection of coins is used. In general, we find the framework to work very well in producing relevant universal volatility forecasting devices, as well as evidence of universal mechanisms in the volatility formation process, as was found in stocks. The findings of the applied methods, regarding predicting volatility, are thus remarkably largely similar in the very different datasets and contexts.\n\nUsing classical auto-regressive models, LSTM and RFSV, we show that the volatility during this period can be modeled and predicted well with the latter two. The non-parametric LSTM and parsimonious RFSV, like for US stocks, outperform all other traditional models used in industry and past literature. While constructing the RFSV forecaster, we estimate the Hurst parameters of the log volatilities for all the coins and showed that their volatilities are indeed 'rough'. While comparing the fine-tuned LSTM and RFSV to their universal counterparts, we observe a universality of this process across the wide selection of coins, which is also observed in stocks.\n\nNext, we use the combination of RFSV and QRH to obtain a parsimonious model. We then find that the RFSV+QRH model can perform as well as the LSTM with both volatility and returns as input. This suggests that the main features in the volatility formation for cryptocurrencies can be described by rough volatility boosted with a strong Zumbach effect. This model has also once again confirmed the universality of the volatility formation process across coins. The obtained models and volatility characteristics can further our understanding of this young and evolving market. Remarkably, this device is found to also perform very well for stock volatility, suggesting a higher level of universality across asset classes.\n\nIn addition, the use of LSTM offers a new way to capture the effect known as asymmetric volatility. By analyzing the gradients of the volatility forecast with respect to past returns, we can capture and confirm the asymmetrical effect of past returns on volatility, and compare this effect with other asset classes. This effect can be further used to infer the behavior and informedness of the traders in these markets. Based on existing results, we can hypothesize cryptocurrency traders tend to react to positive shocks more and might be less informed compared to traditional market participants.\n\n## Acknowledgements\n\nSiu Hin Tang is supported by the SINGA award by A*Star Singapore. Mathieu Rosenbaum is supported by the Ecole Polytechnique's chairs Deep finance and ' statistics and Machine learning and systematic methods. Chao Zhou is supported by the Ministry of Education in Singapore under the MOE AcRF grants A-000425500-00, A-0004273-00-00, A-0004589-00-00 and by Iotex Foundation Ltd under the grant A-8001180-00-00.\n\n## References\n\nAmirshahi, B. and Lahmiri, S. (2023). Hybrid deep learning and GARCH-family models for forecasting volatility of cryptocurrencies. Machine Learning with Applications , 12:100465.\n\nArnosti, N. and Weinberg, S. M. (2022). Bitcoin: A natural oligopoly. Management Science , 68(7):4755-4771.\n\nBaur, D. G. and Dimpfl, T. (2018). Asymmetric volatility in cryptocurrencies. Economics Letters , 173:148-151.\n\nBayer, C., Friz, P., and Gatheral, J. (2016). Pricing under rough volatility. Quantitative Finance , 16(6):887-904.\n\nBennedsen, M., Lunde, A., and Pakkanen, M. S. (2022). Decoupling the short-and long-term behavior of stochastic volatility. Journal of Financial Econometrics , 20(5):961-1006.\n\nBianchi, D. and Babiak, M. (2022). On the performance of cryptocurrency funds. Journal of Banking &amp; Finance , 138:106467.\n\nCheikh, N. B., Zaied, Y. B., and Chevallier, J. (2020). Asymmetric volatility in cryptocurrency markets: New evidence from smooth transition GARCH models. Finance Research Letters , 35:101293.\n\nCorsi, F. (2009). A simple approximate long-memory model of realized volatility. Journal of Financial Econometrics , 7(2):174-196.\n\nDelfabbro, P., King, D. L., and Williams, J. (2021). The psychology of cryptocurrency trading: Risk and protective factors. Journal of behavioral addictions , 10(2):201-207.\n\nDonier, J. and Bonart, J. (2015). A million metaorder analysis of market impact on the Bitcoin. Market Microstructure and Liquidity , 1(02):1550008.\n\nD'Amato, V., Levantesi, S., and Piscopo, G. (2022). Deep learning in predicting cryptocurrency volatility. Physica A: Statistical Mechanics and its Applications , 596:127158.\n\n- El Euch, O., Gatheral, J., and Rosenbaum, M. (2019). Roughening Heston. Risk , pages 84-89.\n- El Euch, O. and Rosenbaum, M. (2018). Perfect hedging in rough Heston models. The Annals of Applied Probability , 28(6):3813-3856.\n- El Euch, O. and Rosenbaum, M. (2019). The characteristic function of rough Heston models. Mathematical Finance , 29(1):3-38.\n- Fang, F., Ventre, C., Basios, M., Kanthan, L., Martinez-Rego, D., Wu, F., and Li, L. (2022). Cryptocurrency trading: a comprehensive survey. Financial Innovation , 8(1):1-59.\n- Gatheral, J., Jaisson, T., and Rosenbaum, M. (2018). Volatility is rough. Quantitative Finance , 18(6):933-949.\n- Gatheral, J., Jusselin, P., and Rosenbaum, M. (2020). The quadratic rough Heston model and the joint S&amp;P 500/VIX smile calibration problem. Risk , May 2020.\n\nGoodfellow, I., Bengio, Y., and Courville, A. (2016). Deep learning . MIT press.\n\n- Griffin, J. M. and Shams, A. (2020). Is Bitcoin really untethered? The Journal of Finance , 75(4):1913-1964.\n- Hendrycks, D. and Gimpel, K. (2020). Gaussian error linear units (gelus). arXiv preprint , arXiv:1606.08415v4.\n\nHochreiter, S. and Schmidhuber, J. (1997). Long short-term memory. Neural Computation , 9(8):1735-1780.\n\nKakinaka, S. and Umeno, K. (2022). Asymmetric volatility dynamics in cryptocurrency markets on multi-time scales. Research in International Business and Finance , 62:101754.\n\nKingma, D. P. and Ba, J. (2015). Adam: a method for stochastic optimization. Proceedings of the International Conference on Learning Representations (ICLR) .\n\nKristjanpoller, W. and Minutolo, M. C. (2018). A hybrid volatility forecasting framework integrating GARCH, artificial neural network, technical analysis and principal components analysis. Expert Systems with Applications , 109:1-11.\n\nLi, T., Shin, D., and Wang, B. (2021). Cryptocurrency pump-and-dump schemes. Available at SSRN 3267041 .\n\nMalik, N., Aseri, M., Singh, P. V., and Srinivasan, K. (2022). Why Bitcoin will fail to scale? Management Science , 68(10):7323-7349.\n\nMita, M., Ito, K., Ohsawa, S., and Tanaka, H. (2019). What is stablecoin?: A survey on price stabilization mechanisms for decentralized payment systems. In 2019 8th International Congress on Advanced Applied Informatics (IIAI-AAI) , pages 60-66. IEEE.\n\nNakamoto, S. (2008). Bitcoin: A peer-to-peer electronic cash system. Available online: http://bitcoin.org/bitcoin.pdf .\n\nPatton, A. J. (2011). Volatility forecast comparison using imperfect volatility proxies. Journal of Econometrics , 160(1):246-256.\n\nRosenbaum, M. and Zhang, J. (2022a). Deep calibration of the quadratic rough Heston model. Risk , Oct 2022.\n\nRosenbaum, M. and Zhang, J. (2022b). On the universality of the volatility formation process: when machine learning and rough volatility agree. To appear in Frontiers in Financial Mathematics .\n\nTakaishi, T. (2020). Rough volatility of Bitcoin. Finance Research Letters , 32:101379.\n\nWu, P., Muzy, J.-F., and Bacry, E. (2022). From rough to multifractal volatility: The log S-fBM model. Physica A: Statistical Mechanics and its Applications , 604:127919.\n\nZumbach, G. (2010). Volatility conditional on price trends. Quantitative Finance , 10(4):431-442."